Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.AttemptToComnnectNonSlopingElementToSlopedPipeWarning
You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.AttemptToComnnectNonSlopingElementToSlopedPipeError
You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.